InformationRegisters/УчетнаяПолитикаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УчетнаяПолитикаОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикЕН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИННПлательщикаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСвидетельстваПлательщикаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УчетнаяПолитикаОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает запись в регистре по переданным данным.
//
//	Параметры:
//		Организация - СправочникСсылка - ссылка на элемент справочника "Организации".
//		Период - Дата - Период записи регистра.
//		УчетнаяПолитика - СправочникСсылка - ссылка на элемент справочника "Учетные политики организаций".
//
Процедура СоздатьЗаписьРегистра(Знач Организация, Период, ИННПлательщикаНДС, НомерСвидетельстваПлательщикаНДС, Знач УчетнаяПолитика) Экспорт
	
	Если Организация = Неопределено ИЛИ Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	

	НоваяЗапись = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = НачалоГода(ТекущаяДатаСеанса());
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.Период = Период;
	НоваяЗапись.ИННПлательщикаНДС                    = ИННПлательщикаНДС;
	НоваяЗапись.НомерСвидетельстваПлательщикаНДС     = НомерСвидетельстваПлательщикаНДС;
	Попытка
		НоваяЗапись.Записать();
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru='Запись в регистр сведений Учетная политика организаций';uk='Запис в регістр відомостей Облікова політика організацій'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

// Функция возвращает структуру параметров действующей для организации учетной политики.
//
//	Параметры:
//		Организация - СправочникСсылка - ссылка на элемент справочника "Организации".
//		Период - Дата - Дата, на которую необходимо получить действующую учетную политику.
//
Функция ПараметрыУчетнойПолитики(Организация, Период) Экспорт
	//
	//Запрос = Новый Запрос("
	//	|ВЫБРАТЬ
	//	|	УчетныеПолитики.Наименование,
	//	|	УчетныеПолитики.МетодОценкиСтоимостиТоваров,
	//	|	УчетныеПолитики.СистемаНалогообложения,
	//	|	ДанныеРегистра.ИННПлательщикаНДС,
	//	|   ДанныеРегистра.НомерСвидетельстваПлательщикаНДС,
	//	|   УчетныеПолитики.ГруппаПлательщикаЕдиногоНалога,
	//	|	УчетныеПолитики.ИнформацияОСтатусеПлательщикаНалогов,
	//	|	УчетныеПолитики.НалогНаПрибыльБезКорректировокФинансовогоРезультата,
	//	|	УчетныеПолитики.ВключатьСуммуДооценокОСВСоставНераспределеннойПрибыли,		
	//	|	УчетныеПолитики.ИспользуемыеКлассыСчетовРасходов,
	//	|	УчетныеПолитики.ПроводкиПоРаботникам
	//	|ИЗ
	//	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Период,
	//	|							Организация = &Организация) КАК ДанныеРегистра
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК УчетныеПолитики
	//	|		ПО ДанныеРегистра.УчетнаяПолитика = УчетныеПолитики.Ссылка");

	//Запрос.УстановитьПараметр("Период", Период);
	//Запрос.УстановитьПараметр("Организация", Организация);

	//Результат = Запрос.Выполнить();
	//Если Результат.Пустой() Тогда
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//Выборка = Результат.Выбрать();
	//Выборка.Следующий();
	
	СтруктураПараметров = Новый Структура;
	//Для Каждого Колонка Из Результат.Колонки Цикл
	//	СтруктураПараметров.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
	//КонецЦикла;
	
	Возврат СтруктураПараметров;
	
КонецФункции

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


#КонецОбласти

#Область ОбновлениеИнформационнойБазы


#КонецОбласти

#КонецЕсли
